In [1]:
import pandas as pd
import numpy as np

In [22]:
week1 = pd.read_csv("restaurant/week_1_sales.csv")

week1.head()

   Customer ID  Food ID
0          537        9
1           97        4
2          658        1
3          202        2
4          155        9

In [23]:
week2 = pd.read_csv("restaurant/week_2_sales.csv")

week2.head()

   Customer ID  Food ID
0          688       10
1          813        7
2          495       10
3          189        5
4          267        3

In [24]:
all_weeks = pd.concat(objs=[week1, week2], keys=["Week 1", "Week 2"])

all_weeks

            Customer ID  Food ID
Week 1 0            537        9
       1             97        4
       2            658        1
       3            202        2
       4            155        9
...                 ...      ...
Week 2 245          783       10
       246          556       10
       247          547        9
       248          252        9
       249          249        6

[500 rows x 2 columns]

In [38]:
ate_both_weeks = week1.merge(
    week2,
    how="inner",
    on="Customer ID",
)

ate_both_weeks.drop_duplicates(subset=["Customer ID"]).head(10)

    Customer ID  Food ID_x  Food ID_y
0           537          9          5
1           155          9          3
2           503          5          8
5           550          6          7
6           101          7          4
7            75          6          4
8            77          1          7
9           628          4          7
10          798          9          5
11          462          3          8

In [31]:
ate_both_weeks[ate_both_weeks["Food ID_x"] == ate_both_weeks["Food ID_y"]]

    Customer ID  Food ID_x  Food ID_y
12          304          3          3
19          540          3          3
21          937         10         10
23          233          3          3
24           21          4          4
32          922          1          1
52           21          4          4
53          578          5          5
54          578          5          5

In [30]:
both_weeks_same_items = week1.merge(
    week2,
    how="inner",
    on=["Customer ID", "Food ID"],
)

both_weeks_same_items

   Customer ID  Food ID
0          304        3
1          540        3
2          937       10
3          233        3
4           21        4
5          922        1
6           21        4
7          578        5
8          578        5

In [25]:
outer_join = week1.merge(
    week2,
    how="outer",
    on="Customer ID",
    indicator=True,
)

outer_join[outer_join["_merge"] == "both"]

     Customer ID  Food ID_x  Food ID_y _merge
5             21        4.0        4.0   both
6             21        4.0        4.0   both
10            30        2.0        4.0   both
14            45        7.0        8.0   both
35            75        6.0        4.0   both
..           ...        ...        ...    ...
424          922        1.0        2.0   both
430          937       10.0       10.0   both
431          937       10.0        2.0   both
436          945        5.0        4.0   both
446          968        1.0        4.0   both

[62 rows x 4 columns]

In [32]:
outer_join[~(outer_join["_merge"] == "both")]

     Customer ID  Food ID_x  Food ID_y      _merge
0              3        2.0        NaN   left_only
1              8        NaN        6.0  right_only
2             10        2.0        NaN   left_only
3             13        NaN        2.0  right_only
4             20        1.0        NaN   left_only
..           ...        ...        ...         ...
449          985        5.0        NaN   left_only
450          991        2.0        NaN   left_only
451          994        NaN        2.0  right_only
452          996        NaN       10.0  right_only
453         1000        2.0        NaN   left_only

[392 rows x 4 columns]

In [33]:
customers = pd.read_csv("restaurant/customers.csv", index_col="ID")

customers

     First Name Last Name  Gender       Company                     Occupation
ID
1        Joseph   Perkins    Male       Dynazzy  Community Outreach Specialist
2      Jennifer   Alvarez  Female          DabZ        Senior Quality Engineer
3         Roger     Black    Male       Tagfeed              Account Executive
4        Steven     Evans    Male          Fatz               Registered Nurse
5          Judy  Morrison  Female       Demivee                Legal Assistant
...         ...       ...     ...           ...                            ...
996       Debra    Garcia  Female  Dazzlesphere            Structural Engineer
997     Douglas    Bishop    Male      Livepath                    Developer I
998       Frank  Franklin    Male    Brainverse             Nurse Practicioner
999     Jessica     Burns  Female    Babbleblab              Financial Advisor
1000      Brian   Daniels    Male         Tazzy     Physical Therapy Assistant

[1000 rows x 5 columns]

In [9]:
foods = pd.read_csv("restaurant/foods.csv", index_col="Food ID")

foods.head()

          Food Item  Price
Food ID
1             Sushi   3.99
2           Burrito   9.99
3              Taco   2.99
4        Quesadilla   4.25
5             Pizza   2.49

In [34]:
week1.merge(
    customers,
    how="left",
    left_on="Customer ID",
    right_index=True,
)

,Customer ID,Food ID,First Name,Last Name,Gender,Company,Occupation
0,537,9,Cheryl,Carroll,Female,Zoombeat,Registered Nurse
1,97,4,Amanda,Watkins,Female,Ozu,Account Coordinator
2,658,1,Patrick,Webb,Male,Browsebug,Community Outreach Specialist
3,202,2,Louis,Campbell,Male,Rhynoodle,Account Representative III
4,155,9,Carolyn,Diaz,Female,Gigazoom,Database Administrator III
...,...,...,...,...,...,...,...
245,413,9,Diane,Bailey,Female,Wikibox,Technical Writer
246,926,6,Anne,Wagner,Female,Skyba,Legal Assistant
247,134,3,Diana,Hall,Female,Quinu,Financial Advisor
248,396,6,Juan,Romero,Male,Zoonder,Analyst Programmer
249,535,10,Nancy,Cox,Female,Trudeo,Research Associate